pok3r-custom/pok3r_re_firmware/firmware/library/HT32F1655_56_Driver/src/ht32f1655_56_mctm.c
/*********************************************************************************************************//**
 * @brief Fill each TimeBaseInit member with its default value.
 * @param TimeBaseInit: Point to a \ref MCTM_TimeBaseInitTypeDef structure.
 * @retval None
 ************************************************************************************************************/
void MCTM_TimeBaseStructInit(MCTM_TimeBaseInitTypeDef* TimeBaseInit)
{
  /* Set the default configuration                                                                          */
  TimeBaseInit->CounterMode = MCTM_CNT_MODE_UP;
  TimeBaseInit->CounterReload = 0xFFFF;
  TimeBaseInit->Prescaler = 0x0000;
  TimeBaseInit->PSCReloadTime = MCTM_PSC_RLD_IMMEDIATE;
  TimeBaseInit->RepetitionCounter = 0;
}

/*********************************************************************************************************//**
 * @brief Fill each OutInit member with its default value.
 * @param OutInit: Point to a \ref MCTM_OutputInitTypeDef structure.
 * @retval None
 ************************************************************************************************************/
void MCTM_OutputStructInit(MCTM_OutputInitTypeDef* OutInit)
{
  /* Set the default configuration                                                                          */
  OutInit->Channel = MCTM_CH_0;
  OutInit->OutputMode = MCTM_OM_MATCH_NOCHANGE;
  OutInit->Control = MCTM_CHCTL_DISABLE;
  OutInit->ControlN = MCTM_CHCTL_DISABLE;
  OutInit->Polarity = MCTM_CHP_NONINVERTED;
  OutInit->PolarityN = MCTM_CHP_NONINVERTED;
  OutInit->IdleState = MCTM_OIS_LOW;
  OutInit->IdleStateN = MCTM_OIS_LOW;
  OutInit->Compare = 0x0000;
  OutInit->AsymmetricCompare = 0x0000;
}

/*********************************************************************************************************//**
 * @brief Fill each CapInit member with its default value.
 * @param CapInit: Point to a \ref MCTM_CaptureInitTypeDef structure.
 * @retval None
 ************************************************************************************************************/
void MCTM_CaptureStructInit(MCTM_CaptureInitTypeDef* CapInit)
{
  /* Set the default configuration                                                                          */
  CapInit->Channel = MCTM_CH_0;
  CapInit->Polarity = MCTM_CHP_NONINVERTED;
  CapInit->Selection = MCTM_CHCCS_DIRECT;
  CapInit->Prescaler = MCTM_CHPSC_OFF;
  CapInit->Filter = 0x00;
}

/*********************************************************************************************************//**
 * @brief Enable or Disable MCTMx counter.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void MCTM_Cmd(HT_MCTM_TypeDef* MCTMx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    /* Enable the MCTM Counter                                                                              */
    MCTMx->CTR |= CTR_TME;
  }
  else
  {
    /* Disable the MCTM Counter                                                                             */
    MCTMx->CTR &= ~CTR_TME;
  }
}

/*********************************************************************************************************//**
 * @brief Configure external clock mode of the MCTMx. Used ITIx as the clock source.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Iti: Trigger source.
 *        This parameter can be one of the following values:
 *        @arg MCTM_TRSEL_ITI0: Internal trigger 0
 *        @arg MCTM_TRSEL_ITI1: Internal trigger 1
 *        @arg MCTM_TRSEL_ITI2: Internal trigger 2
 * @retval None
 ************************************************************************************************************/
void MCTM_ItiExternalClockConfig(HT_MCTM_TypeDef* MCTMx, MCTM_TRSEL_Enum Iti)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_MCTM_ITI(Iti));

  /* Select the Internal Trigger. Slave mode will be disable in this function                               */
  MCTM_StiConfig(MCTMx, Iti);

  /* Select the STIED as external clock source                                                              */
  MCTMx->MDCFR |= MCTM_SMSEL_STIED;
}

/*********************************************************************************************************//**
 * @brief Configure external clock mode of the MCTMx. Used CHx as the clock source.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Sel: Specify the channel source.
 *        This parameter can be one of the following values:
 *        @arg MCTM_TRSEL_TI0BED : TI0 both edge detector
 *        @arg MCTM_TRSEL_TI0S0 : Filtered timer input 0
 *        @arg MCTM_TRSEL_TI1S1 : Filtered timer input 1
 * @param Pol: Specify the CHx Polarity.
 *        This parameter can be one of the following values:
 *        @arg MCTM_CHP_NONINVERTED : active high.
 *        @arg MCTM_CHP_INVERTED    : active low.
 * @param Filter: Specify the filter value.
 *        This parameter must be a value between 0x0 and 0xF.
 * @retval None
 ************************************************************************************************************/
void MCTM_ChExternalClockConfig(HT_MCTM_TypeDef* MCTMx, MCTM_TRSEL_Enum Sel, MCTM_CHP_Enum Pol, u8 Filter)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_MCTM_TRSEL_CH(Sel));
  Assert_Param(IS_MCTM_CHP(Pol));
  Assert_Param(IS_MCTM_FILTER(Filter));

  /* Configure the Timer Input Clock Source                                                                 */
  if (Sel == MCTM_TRSEL_TI1S1)
  {
    mctm_CHx_Config(MCTMx, MCTM_CH_1, Pol, MCTM_CHCCS_DIRECT, Filter);
  }
  else
  {
    mctm_CHx_Config(MCTMx, MCTM_CH_0, Pol, MCTM_CHCCS_DIRECT, Filter);
  }

  /* Select the external clock source. Slave mode will be disable in this function                          */
  MCTM_StiConfig(MCTMx, Sel);

  /* Select the STIED as external clock source                                                              */
  MCTMx->MDCFR |= MCTM_SMSEL_STIED;
}

