pok3r-custom/pok3r_re_firmware/firmware/library/HT32F1655_56_Driver/src/ht32f1655_56_mctm.c
/*********************************************************************************************************//**
 * @brief Set counter reload register value of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Reload: Specify the counter reload register new value.
 * @retval None
 ************************************************************************************************************/
void MCTM_SetCounterReload(HT_MCTM_TypeDef* MCTMx, u16 Reload)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));

  /* Set the counter reload register value                                                                  */
  MCTMx->CRR = Reload;
}

/*********************************************************************************************************//**
 * @brief Set channel 0 capture/compare register value of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Cmp: Specify the CH0CCR register new value.
 * @retval None
 ************************************************************************************************************/
void MCTM_SetCaptureCompare0(HT_MCTM_TypeDef* MCTMx, u16 Cmp)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));

  /* Set the CH0CCR register new value                                                                      */
  MCTMx->CH0CCR = Cmp;
}

/*********************************************************************************************************//**
 * @brief Set channel 1 capture/compare register value of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Cmp: Specify the CH1CCR register new value.
 * @retval None
 ************************************************************************************************************/
void MCTM_SetCaptureCompare1(HT_MCTM_TypeDef* MCTMx, u16 Cmp)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));

  /* Set the CH1CCR register new value                                                                      */
  MCTMx->CH1CCR = Cmp;
}

/*********************************************************************************************************//**
 * @brief Set channel 2 capture/compare register value of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Cmp: Specify the CH2CCR register new value.
 * @retval None
 ************************************************************************************************************/
void MCTM_SetCaptureCompare2(HT_MCTM_TypeDef* MCTMx, u16 Cmp)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));

  /* Set the CH2CCR register new value                                                                      */
  MCTMx->CH2CCR = Cmp;
}

/*********************************************************************************************************//**
 * @brief Set channel 3 capture/compare register value of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Cmp: Specify the CH3CCR register new value.
 * @retval None
 ************************************************************************************************************/
void MCTM_SetCaptureCompare3(HT_MCTM_TypeDef* MCTMx, u16 Cmp)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));

  /* Set the CH3CCR register new value                                                                      */
  MCTMx->CH3CCR = Cmp;
}

/*********************************************************************************************************//**
 * @brief Set channel 0 asymmetric compare register value of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Cmp: Specify the CH0ACR register new value.
 * @retval None
 ************************************************************************************************************/
void MCTM_SetAsymmetricCompare0(HT_MCTM_TypeDef* MCTMx, u16 Cmp)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));

  /* Set the CH0ACR register new value                                                                      */
  MCTMx->CH0ACR = Cmp;
}

/*********************************************************************************************************//**
 * @brief Set channel 1 asymmetric compare register value of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Cmp: Specify the CH1ACCR register new value.
 * @retval None
 ************************************************************************************************************/
void MCTM_SetAsymmetricCompare1(HT_MCTM_TypeDef* MCTMx, u16 Cmp)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));

  /* Set the CH1ACR register new value                                                                      */
  MCTMx->CH1ACR = Cmp;
}

/*********************************************************************************************************//**
 * @brief Set channel 2 asymmetric compare register value of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Cmp: Specify the CH2ACR register new value.
 * @retval None
 ************************************************************************************************************/
void MCTM_SetAsymmetricCompare2(HT_MCTM_TypeDef* MCTMx, u16 Cmp)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));

  /* Set the CH2ACR register new value                                                                      */
  MCTMx->CH2ACR = Cmp;
}

