pok3r-custom/pok3r_re_firmware/firmware/library/HT32F1655_56_Driver/src/ht32f1655_56_mctm.c
/*********************************************************************************************************//**
 * @brief Set channel 3 asymmetric compare register value of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Cmp: Specify the CH3ACR register new value.
 * @retval None
 ************************************************************************************************************/
void MCTM_SetAsymmetricCompare3(HT_MCTM_TypeDef* MCTMx, u16 Cmp)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));

  /* Set the CH3ACR register new value                                                                      */
  MCTMx->CH3ACR = Cmp;
}

/*********************************************************************************************************//**
 * @brief Configure input capture prescaler.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Channel: Specify the MCTM channel.
 *        This parameter can be one of the following values:
 *        @arg MCTM_CH_0 : MCTM channel 0
 *        @arg MCTM_CH_1 : MCTM channel 1
 *        @arg MCTM_CH_2 : MCTM channel 2
 *        @arg MCTM_CH_3 : MCTM channel 3
 * @param Psc: Specify the input capture prescaler new value.
 *        This parameter can be one of the following values:
 *        @arg MCTM_CHPSC_OFF : No prescaler
 *        @arg MCTM_CHPSC_2   : Capture is done once every 2 events
 *        @arg MCTM_CHPSC_4   : Capture is done once every 4 events
 *        @arg MCTM_CHPSC_8   : Capture is done once every 8 events
 * @retval None
 ************************************************************************************************************/
void MCTM_CHPSCConfig(HT_MCTM_TypeDef* MCTMx, MCTM_CH_Enum Channel, MCTM_CHPSC_Enum Psc)
{
  vu32 *pIcfr = (vu32*)&MCTMx->CH0ICFR + Channel;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_MCTM_CH(Channel));
  Assert_Param(IS_MCTM_CHPSC(Psc));

  /* Reset the CHxPSC bits                                                                                  */
  *pIcfr &= CHICFR_CHPSC_MASK;

  /* Set the capture input prescaler value                                                                  */
  *pIcfr |= Psc;
}

/*********************************************************************************************************//**
 * @brief Set clock division value of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Div: Specify the clock division value.
 *        This parameter can be one of the following value:
 *        @arg MCTM_CKDIV_OFF : fDTS = fCLKIN
 *        @arg MCTM_CKDIV_2   : fDTS = fCLKIN / 2
 *        @arg MCTM_CKDIV_4   : fDTS = fCLKIN / 4
 * @retval None
 ************************************************************************************************************/
void MCTM_CKDIVConfig(HT_MCTM_TypeDef* MCTMx, MCTM_CKDIV_Enum Div)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_MCTM_CKDIV(Div));

  /* Reset the CKDIV Bits                                                                                   */
  MCTMx->CNTCFR &= CNTCFR_CKDIV_MASK;

  /* Set the CKDIV value                                                                                    */
  MCTMx->CNTCFR |= Div;
}

/*********************************************************************************************************//**
 * @brief Get channel 0 capture/compare register value of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @return Value of CH0CCR register
 ************************************************************************************************************/
u32 MCTM_GetCaptureCompare0(HT_MCTM_TypeDef* MCTMx)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));

  /* Get the CH0CCR register value                                                                          */
  return MCTMx->CH0CCR;
}

/*********************************************************************************************************//**
 * @brief Get channel 1 capture/compare register value of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @return Value of CH1CCR register
 ************************************************************************************************************/
u32 MCTM_GetCaptureCompare1(HT_MCTM_TypeDef* MCTMx)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));

  /* Get the CH1CCR register value                                                                          */
  return MCTMx->CH1CCR;
}

/*********************************************************************************************************//**
 * @brief Get channel 2 capture/compare register value of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @return Value of CH2CCR register
 ************************************************************************************************************/
u32 MCTM_GetCaptureCompare2(HT_MCTM_TypeDef* MCTMx)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));

  /* Get the CH2CCR register value                                                                          */
  return MCTMx->CH2CCR;
}

/*********************************************************************************************************//**
 * @brief Get channel 3 capture/compare register value of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @return Value of CH3CCR register
 ************************************************************************************************************/
u32 MCTM_GetCaptureCompare3(HT_MCTM_TypeDef* MCTMx)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));

